rdlaner/micropython/ports/esp32/boards/POWERFEATHER/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "PowerFeather"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "power-feather"

// STEMMA QT I2C
#define MICROPY_HW_I2C0_SCL                 (48)
#define MICROPY_HW_I2C0_SDA                 (47)

#define MICROPY_HW_I2C1_SCL                 (36)
#define MICROPY_HW_I2C1_SDA                 (35)

#define MICROPY_HW_SPI1_MOSI                (40)
#define MICROPY_HW_SPI1_MISO                (41)
#define MICROPY_HW_SPI1_SCK                 (39)
